// ==========================
// 공연 ID 가져오기
// ==========================

console.log("seatmap.js 실행됨");




const seatContainer =
    document.getElementById("seat-container");


console.log("JS 받은 값:", concertId);



let seatLayout;


if (concertId === "PF277688") {


    seatLayout = [

        [
            "N","N",
            "A","A","A"
        ]

    ];


}
else if (concertId === "2") {


    seatLayout = [

        [
            "A","A","A"
        ]

    ];


}
else {


    console.log(
        "비교 실패 값:",
        concertId
    );


    alert(
        "좌석 배치 정보가 없습니다."
    );


    seatLayout = [];

}




// ==========================
// 공연별 좌석 배치 선택
// ==========================

let seatLayout;


if(concertId === "PF277688") {


    // ======================
    // 공연장 1
    // ======================

    seatLayout = [


        // 앞쪽
        [
            "N","N","N","N","N","N","N","N",
            "A","A","A","A","A","A",
            "N","N"
        ],


        [
            "A","A","A","N",
            "N","A","A",
            "N",
            "A","A","A","N",
            "A","A"
        ],



        // 중앙
        [
            "A","A","A","A","A",
            "A","A","A","A","A",
            "A","A","A","A"
        ],


        [
            "A","A","A","A","A",
            "A","A","A","A","A",
            "A","A","A","A"
        ],


        [
            "A","A","A","A","A",
            "A","A","A","A","A",
            "A","A","A","A"
        ],


        [
            "A","A","A","A","A",
            "A","A","A","A","A",
            "A","A","A","A"
        ],



        // 뒤쪽
        [
            "A","A","A","A","A",
            "A","A","A","A","A",
            "A","A","A","A"
        ]

    ];


}



else if (concertId === "2") {


    // ======================
    // 공연장 2
    // ======================

    seatLayout = [



        // 1
        [
            'A','A','A','A',
            'A','A','A','A',
            'N',
            'A','A','A','A'
        ],



        // 2
        [
            'A','A','A','A',
            'A','A','A','A',
            'N',
            'A','A','A','A'
        ],



        // 3
        [
            'A','A','A','A',
            'A','A','A','A',
            'N',
            'A','A','A','A'
        ],



        // 4
        [
            'A','A','A','A',
            'A','A','A','A',
            'N',
            'A','A','A','A'
        ],



        // 5
        [
            'A','A','A','A',
            'A','A','A','A',
            'N',
            'A','A','A','A'
        ],



        // 6
        [
            'A','A','A','A',
            'A','A','A','A',
            'N',
            'A','A','A','A'
        ],



        // 7
        [
            'N','N',
            'A','A','A','A','A','A',
            'N',
            'A','A','A','A','A',
            'N','N'
        ],



        // 8
        [
            'N','N',
            'A','A','A','A','A','A',
            'N',
            'A','A','A','A','A',
            'N','N'
        ],



        // 9
        [
            'N','N',
            'A','A','A','A','A','A',
            'N',
            'A','A','A','A','A','A',
            'N'
        ],



        // 10
        [
            'N','N',
            'A','A','A','A','A','A',
            'N',
            'A','A','A','A','A','A',
            'N'
        ],



        // 11
        [
            'N',
            'A','A','A','A','A','A','A',
            'N',
            'A','A','A','A','A','A',
            'N'
        ],



        // 12
        [
            'N',
            'A','A','A','A','A','A','A',
            'N',
            'A','A','A','A','A','A',
            'N'
        ],



        // 13
        [
            'N',
            'A','A','A','A','A','A','A',
            'N',
            'A','A','A','A','A','A',
            'N'
        ]

    ];


}



else {


    alert(
        "좌석 배치 정보가 없습니다."
    );


    seatLayout = [];


}

